#include <QCoreApplication>

int main(int argc, char *argv[])
{
    QCoreApplication a(argc, argv);

    return a.exec();
}

//1. Создайте класс Date с полями день, месяц, год и методами доступа к
//этим полям. Перегрузите оператор вывода для данного класса. Создайте
//два "умных" указателя today и date. Первому присвойте значение
//сегодняшней даты. Для него вызовите по отдельности методы доступа к
//полям класса Date, а также выведите на экран данные всего объекта с
//помощью перегруженного оператора вывода. Затем переместите ресурс,
//которым владеет укзаатель today в указатель date. Проверьте, являются
//ли нулевыми указатели today и date и выведите соответствующую
//информацию об этом в консоль.
//2. По условию предыдущей задачи создайте два умных указателя
//date1 и date2.
//** Создайте функцию, которая принимает в качестве параметра два умных
//указателя типа Date и сравнивает их между собой (сравнение происходит
//по датам). Функция должна вернуть более позднюю дату.
//** Создайте функцию, которая обменивает ресурсами (датами) два умных
//указателя, переданных в функцию в качестве параметров.
//Примечание: обратите внимание, что первая функция не должна
//уничтожать объекты, переданные ей в качестве параметров.




