#!/bin/bash
#Р РЋР Т‘Р ВµР В»Р В°Р ВµР С� РЎРѓР С”РЎР‚Р С‘Р С—РЎвЂљ Р Т‘Р В»РЎРЏ Р В·Р В°Р С–РЎР‚РЎС“Р В·Р С”Р С‘ Р Р…Р ВµРЎРѓР С”Р С•Р В»РЎРЉР С”Р С‘РЎвЂ¦ Р С‘Р В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘Р в„–
#Р Р† Р С—РЎР‚Р С•Р С–РЎР‚Р В°Р С�Р С�РЎС“ categorizer Р СџРЎР‚Р С•Р ВµР С”РЎвЂљР В° Р Р…Р В° Р РЋ++
#РљР»Р°РґРµРј СЃРєСЂРёРїС‚ РІ РєР°С‚Р°Р»РѕРі СЃ Р±РёРЅР°СЂРЅС‹Рј С„Р°Р№Р»РѕРј Рё РёР·РѕР±СЂР°Р¶РµРЅРёСЏРјРё

echo "Р вЂ“Р ВµР В»Р В°Р ВµРЎвЂљР Вµ Р Р…Р С•РЎР‚Р С�Р С‘РЎР‚Р С•Р Р†Р В°РЎвЂљРЎРЉ Р Р†РЎРѓР Вµ Р С–Р С‘РЎРѓРЎвЂљР С•Р С–РЎР‚Р В°Р С�Р С�РЎвЂ№? [y/n]: "
read -n 1 a
echo " "

	for img in *.PGM *.pgm
	do

		if [[ "$a" = "y" ]]
		then
			yes | ./categorizer $img | grep -v "ать гист"
			echo " "
		else 
			pwd | ./categorizer $img | grep -v "ать гист"
			echo " "
		fi	

	done
